// import axios from 'axios';
// import { CityDataAll } from '../@types/city/cityType';

import { ReactNode } from 'react';
import { JSX } from 'react/jsx-runtime';

// export const fetchCity = async (): Promise<CityDataAll> => {
//   const response = await axios.get(
//     `https://api.vworld.kr/req/data?key=${process.env.VITE_CITY_KEY}&domain=${process.env.VITE_DOMAIN}&service=data&version=2.0&request=getfeature&format=json&size=1000&page=1&geometry=false&attribute=true&crs=EPSG:4326&geomfilter=BOX(122.77143441739624, 32.689674111652815, 133.16466627619113, 42.0516845871052)&data=LT_C_ADSIDO_INFO`,
//   );
//   return response;
// };

// export const fetchGoon = async (): Promise<CityDataAll> => {
//   const response = await axios.get(
//   `https://api.vworld.kr/req/data?service=data&request=GetFeature&data=LT_C_ADSIGG_INFO&key=${process.env.VITE_CITY_KEY}&domain=${process.env.VITE_DOMAIN}&format=json&attrFilter=full_nm:like:%${}&geometry=false`,
//   );
//   return response;
//   };

export const city: string[] = ['전체', '서울', '부산', '대구', '인천', '광주', '대전', '울산', '경기', '강원', '충북', '충남', '세종', '전북', '전남', '경북', '경남', '제주'];

type CITYOBJ = {
  전체: string[];
  서울: string[];
  부산: string[];
  대구: string[];
  인천: string[];
  광주: string[];
  대전: string[];
  울산: string[];
  경기: string[];
  강원: string[];
  충남: string[];
  충북: string[];
  세종: string[];
  전북: string[];
  전남: string[];
  경북: string[];
  경남: string[];
  제주: string[];
};

export const cityObj: CITYOBJ = {
  전체: [],
  서울: [
    '전체',
    '강남구',
    '강동구',
    '강북구',
    '강서구',
    '관악구',
    '광진구',
    '구로구',
    '금천구',
    '노원구',
    '도봉구',
    '동대문구',
    '동작구',
    '마포구',
    '서대문구',
    '서초구',
    '성동구',
    '성북구',
    '송파구',
    '양천구',
    '영등포구',
    '용산구',
    '은평구',
    '종로구',
    '중구',
    '중랑구',
  ],
  부산: ['전체', '중구', '서구', '동구', '영도구', '부산진구', '동래구', '남구', '북구', '해운대구', '사하구', '금정구', '강서구', '연제구', '수영구', '사상구', '기장군'],
  대구: ['전체', '중구', '동구', '서구', '남구', '북구', '수성구', '달서구', '달성군'],
  인천: ['전체', '중구', '동구', '미추홀구', '연수구', '남동구', '부평구', '계양구', '서구', '강화군', '옹진군'],
  광주: ['전체', '동구', '서구', '남구', '북구', '관산구'],
  대전: ['전체', '동구', '중구', '서구', '유성구', '대덕구'],
  울산: ['전체', '중구', '남구', '동구', '북구', '울주군'],
  경기: [
    '전체',
    '가평군',
    '고양시 덕양구',
    '고양시 일산동구',
    '고양시 일산서구',
    '과천시',
    '광명시',
    '광주시',
    '구리시',
    '군포시',
    '김포시',
    '남양주시',
    '동두천시',
    '부천시 소사구',
    '부천시 오정구',
    '부천시 원미구',
    '성남시 분당구',
    '성남시 수정구',
    '성남시 중원구',
    '수원시 권선구',

    '수원시 영통구',
    '수원시 장안구',
    '수원시 팔달구',
    '시흥시',
    '안산시 단원구',
    '안산시 상록구',
    '안성시',
    '안양시 동안구',
    '안양시 만안구',
    '양주시',
    '양평군',
    '여주군',
    '연천군',
    '오산시',
    '용인시 기흥구',
    '용인시 수지구',
    '용인시 처인구',
    '의왕시',
    '의정부시',
    '이천시',
    '파주시',
    '평택시',
    '포천시',
    '하남시',
    '화성시',
  ],
  강원: ['전체', '춘천시', '원주시', '강릉시', '동해시', '태백시', '속초시', '삼척시', '홍천군', '횡성군', '영원군', '평창군', '정선군', '철원군', '화천군', '양구군', '인제군', '고성군', '양양군'],
  충북: ['전체', '청주시 상당구', '청주시 흥덕구', '충주시', '제천시', '청주시 청원구', '보은군', '옥천군', '영동군', '증평군', '진천군', '괴산군', '음성군', '단양군', '청주시 서원구'],
  충남: ['전체', '천안시 동남구', '천안시 서북구', '공주시', '보령시', '아산시', '서산시', '논산시', '계룡시', '당진시', '금산군', '부여군', '서천군', '청양군', '홍성군', '예산군', '태안군'],
  세종: ['전체', '세종시'],
  전북: ['전체', '전주시 덕진구', '전주시 완산구', '군산시', '익산시', '정읍시', '남원시', '김제시', '완주군', '진안군', '무주군', '장수군', '임실군', '순창군', '고창군', '부안군'],
  전남: ['전체', '목포시', '여수시', '순천시', '나주시', '광양시', '담양군', '곡성군', '구례군', '고흥군', '보성군', '화순군', '장흥군', '강진군', '해남군', '양암군', '무안군', '함평군', '영광군', '장성군', '완도군', '진도군', '신안군'],
  경북: [
    '전체',
    '포항시 남구',
    '포항시 북구',
    '경주시',
    '김천시',
    '안동시',
    '구미시',
    '영주시',
    '영천시',
    '상주시',
    '문경시',
    '경산시',
    '군위군',
    '의성군',
    '청송군',
    '영양군',
    '영덕군',
    '청도군',
    '고령군',
    '성주군',
    '칠곡군',
    '예천군',
    '봉화군',
    '울진군',
    '울릉군',
  ],
  경남: [
    '전체',
    '창원시 마산합포구',
    '창원시 마산회원구',
    '창원시 성산구',
    '창원시 의창군',
    '창원시 진해구',
    '진주시',
    '통영시',
    '사천시',
    '김해시',
    '밀양시',
    '거제시',
    '양산시',
    '의령군',
    '함안군',
    '창녕군',
    '고성군',
    '남해군',
    '하동군',
    '산청군',
    '함양군',
    '거창군',
    '합천군',
  ],
  제주: ['전체', '제주시', '서귀포시'],
};

////////////

export const AREA0 = ['전체', '서울', '인천', '대전', '광주', '대구', '울산', '부산', '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주'];

export const 서울 = [
  '전체',
  '강남구',
  '강동구',
  '강북구',
  '강서구',
  '관악구',
  '광진구',
  '구로구',
  '금천구',
  '노원구',
  '도봉구',
  '동대문구',
  '동작구',
  '마포구',
  '서대문구',
  '서초구',
  '성동구',
  '성북구',
  '송파구',
  '양천구',
  '영등포구',
  '용산구',
  '은평구',
  '종로구',
  '중구',
  '중랑구',
];
export const 인천 = ['전체', '계양구', '남구', '남동구', '동구', '부평구', '서구', '연수구', '중구', '강화군', '옹진군'];
export const 대전 = ['전체', '대덕구', '동구', '서구', '유성구', '중구'];
export const 광주 = ['전체', '광산구', '남구', '동구', '북구', '서구'];
export const 대구 = ['전체', '남구', '달서구', '동구', '북구', '서구', '수성구', '중구', '달성군'];
export const 울산 = ['전체', '남구', '동구', '북구', '중구', '울주군'];
export const 부산 = ['전체', '강서구', '금정구', '남구', '동구', '동래구', '부산진구', '북구', '사상구', '사하구', '서구', '수영구', '연제구', '영도구', '중구', '해운대구', '기장군'];
export const 경기 = [
  '전체',
  '고양시',
  '과천시',
  '광명시',
  '광주시',
  '구리시',
  '군포시',
  '김포시',
  '남양주시',
  '동두천시',
  '부천시',
  '성남시',
  '수원시',
  '시흥시',
  '안산시',
  '안성시',
  '안양시',
  '양주시',
  '오산시',
  '용인시',
  '의왕시',
  '의정부시',
  '이천시',
  '파주시',
  '평택시',
  '포천시',
  '하남시',
  '화성시',
  '가평군',
  '양평군',
  '여주군',
  '연천군',
];
export const 강원 = ['전체', '강릉시', '동해시', '삼척시', '속초시', '원주시', '춘천시', '태백시', '고성군', '양구군', '양양군', '영월군', '인제군', '정선군', '철원군', '평창군', '홍천군', '화천군', '횡성군'];
export const 충북 = ['전체', '제천시', '청주시', '충주시', '괴산군', '단양군', '보은군', '영동군', '옥천군', '음성군', '증평군', '진천군', '청원군'];
export const 충남 = ['전체', '계룡시', '공주시', '논산시', '보령시', '서산시', '아산시', '천안시', '금산군', '당진군', '부여군', '서천군', '연기군', '예산군', '청양군', '태안군', '홍성군'];
export const 전북 = ['전체', '군산시', '김제시', '남원시', '익산시', '전주시', '정읍시', '고창군', '무주군', '부안군', '순창군', '완주군', '임실군', '장수군', '진안군'];
export const 전남 = ['전체', '광양시', '나주시', '목포시', '순천시', '여수시', '강진군', '고흥군', '곡성군', '구례군', '담양군', '무안군', '보성군', '신안군', '영광군', '영암군', '완도군', '장성군', '장흥군', '진도군', '함평군', '해남군', '화순군'];
export const 경북 = [
  '전체',
  '경산시',
  '경주시',
  '구미시',
  '김천시',
  '문경시',
  '상주시',
  '안동시',
  '영주시',
  '영천시',
  '포항시',
  '고령군',
  '군위군',
  '봉화군',
  '성주군',
  '영덕군',
  '영양군',
  '예천군',
  '울릉군',
  '울진군',
  '의성군',
  '청도군',
  '청송군',
  '칠곡군',
];
export const 경남 = ['전체', '거제시', '김해시', '마산시', '밀양시', '사천시', '양산시', '진주시', '진해시', '창원시', '통영시', '거창군', '고성군', '남해군', '산청군', '의령군', '창녕군', '하동군', '함안군', '함양군', '합천군'];
export const 제주 = ['전체', '서귀포시', '제주시', '남제주군', '북제주군'];
